tap "adoptopenjdk/openjdk"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "remotemobprogramming/brew"
tap "yqrashawn/goku"
cask "adoptopenjdk8"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern replacement for 'ls'
brew "exa"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Easiest way to build and release mobile apps
brew "fastlane"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql", restart_service: true
# Data loading tool for PostgreSQL
brew "pgloader"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Display and control your Android device
brew "scrcpy"
# The cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"
# karabiner configurator
brew "yqrashawn/goku/goku"
cask "alacritty"
cask "docker"
cask "hammerspoon"
cask "karabiner-elements"
cask "rectangle"
cask "skype"
cask "unshaky"
