tap "adoptopenjdk/openjdk"
tap "bramstein/webfonttools"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "remotemobprogramming/brew"
# Tool for reverse engineering 3rd party, closed, binary Android apps
brew "apktool"
# Shell extension to jump to frequently used directories
brew "autojump"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Tools to convert fonts from OTF/TTF to EOT format
brew "eot-utils"
# Modern replacement for 'ls'
brew "exa"
# Easiest way to build and release mobile apps
brew "fastlane"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Platform built on V8 to build network applications
brew "node"
# Firebase command-line tools
brew "firebase-cli"
# Command-line outline and bitmap font editor/converter
brew "fontforge"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Object-relational database system
brew "postgresql", restart_service: true
# Data loading tool for PostgreSQL
brew "pgloader"
# Colored logcat script to show entries only for specified app
brew "pidcat"
# Java class file shrinker, optimizer, and obfuscator
brew "proguard"
# Python version management
brew "pyenv"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Display and control your Android device
brew "scrcpy"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Utilities to create and convert Web Open Font File (WOFF) files
brew "woff2"
# JavaScript package manager
brew "yarn"
# Convert existing TrueType/OpenType fonts to WOFF format
brew "bramstein/webfonttools/sfnt2woff"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"
cask "adoptopenjdk8"
cask "alfred"
cask "bitwarden"
cask "charles"
cask "docker"
cask "figma"
cask "gitkraken"
cask "grammarly"
cask "hammerspoon"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "postman"
cask "rectangle"
cask "sketch"
cask "skype"
cask "slack"
cask "spotify"
cask "telegram"
cask "unshaky"
cask "visualvm"
